{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser5a\/article\/841775","title":"Characteristics of question format web queries: an exploratory study","abstract":"Web queries in question format are becoming a common element of a user's interaction with Web search engines. Web search services such as Ask Jeeves - a publicly accessible question and answer (Q&A) search engine-request users to enter question format queries. This paper provides results from a study examining queries in question format submitted to two different Web search engines - Ask Jeeves that explicitly encourages queries in question format and the Excite search service that does not explicitly encourage queries in question format. We identify the characteristics of queries in question format in two different data sets: (1) 30,000 Ask Jeeves queries and 15,575 Excite queries, including the nature, length, and structure of queries in question format. Findings include: (1) 50% of Ask Jeeves queries and less than 1% of Excite were in question format, (2) most users entered only one query in question format with little query reformulation, (3) limited range of formats for queries in question format - mainly \"where\", \"what\", or \"how\" questions, (4) most common question query format was \"Where can I find ......... \" for general information on a topic, and (5) non-question queries may be in request format. Overall, four types of user Web queries were identified: keyword, Boolean, question, and request. These findings provide an initial mapping of the structure and content of queries in question and request format. Implications for Web search services are discussed.","additional_locations":{"location":["http:\/\/portal.acm.org\/citation.cfm?id=603533.603534","http:\/\/dx.doi.org\/10.1016\/S0306-4573(01)00042-5","http:\/\/www.citeulike.org\/user\/anonyuser5a\/article\/841775","http:\/\/www.citeulike.org\/user\/anonyuser5a\/article\/841775","http:\/\/pubget.com\/search?q=doi:10.1016%2FS0306-4573(01)00042-5","http:\/\/www.ncbi.nlm.nih.gov\/pubmed?term=10.1016%2FS0306-4573(01)00042-5[aid]&cmd=DetailsSearch"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser5a\/author\/Spink:A","name":"Amanda Spink"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser5a\/author\/Ozmultu:HC","name":"H. Cenk Ozmultu"}]},"source":{"mm_name":"source","title":"Inf. Process. Manage., Vol. 38, No. 4. (July 2002), pp. 453-471, doi:10.1016\/S0306-4573(01)00042-5ￂﾠ Key: citeulike:841775"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser5a\/tag\/no-tag","title":"no-tag"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","location":"http:\/\/dx.doi.org\/10.1016\/S0306-4573(01)00042-5","title":"Characteristics of question format web queries: an exploratory study"}}}