{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser2b\/article\/93878","title":"Learning Bayesian Networks: The Combination of Knowledge and Statistical Data","abstract":"We describe a Bayesian approach for learning Bayesian networks from a combination of prior knowledge and statistical data. First and foremost, we develop a methodology for assessing informative priors needed for learning. Our approach is derived from a set of assumptions made previously as well as the assumption of likelihood equivalence, which says that data should not help to discriminate network structures that represent the same assertions of conditional independence. We show that likelihood equivalence when combined with previously made assumptions implies that the user's priors for network parameters can be encoded in a single Bayesian network for the next case to be seen—a prior network—and a single measure of confidence for that network. Second, using these priors, we show how to compute the relative posterior probabilities of network structures given data. Third, we describe search methods for identifying network structures with high posterior probabilities. We describe polynomial algorithms for finding the highest-scoring network structures in the special case where every node has at most k &equals; 1 parent. For the general case (k > 1), which is NP-hard, we review heuristic search algorithms including local search, iterative local search, and simulated annealing. Finally, we describe a methodology for evaluating Bayesian-network learning algorithms, and apply this approach to a comparison of various approaches.","additional_locations":{"location":["http:\/\/portal.acm.org\/citation.cfm?id=218921","http:\/\/dx.doi.org\/10.1023\/A:1022623210503","http:\/\/www.citeulike.org\/user\/anonyuser2b\/article\/93878","http:\/\/www.citeulike.org\/user\/anonyuser2b\/article\/93878","http:\/\/pubget.com\/search?q=doi:10.1023%2FA%3A1022623210503","http:\/\/www.ncbi.nlm.nih.gov\/pubmed?term=10.1023%2FA%3A1022623210503[aid]&cmd=DetailsSearch"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser2b\/author\/Heckerman:D","name":"David Heckerman"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser2b\/author\/Geiger:D","name":"Dan Geiger"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser2b\/author\/Chickering:DM","name":"David M. Chickering"}]},"source":{"mm_name":"source","title":"Mach. Learn., Vol. 20, No. 3. (September 1995), pp. 197-243, doi:10.1023\/A:1022623210503ￂﾠ Key: citeulike:93878"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser2b\/tag\/no-tag","title":"no-tag"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","location":"http:\/\/dx.doi.org\/10.1023\/A:1022623210503","title":"Learning Bayesian Networks: The Combination of Knowledge and Statistical Data"}}}