{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser2b\/article\/11479394","title":"To each his own: personalized content selection based on text comprehensibility","abstract":"Imagine a physician and a patient doing a search on antibiotic resistance. Or a chess amateur and a grandmaster conducting a search on Alekhine's Defence. Although the topic is the same, arguably the two users in each case will satisfy their information needs with very different texts. Yet today search engines mostly adopt the one-size-fits-all solution, where personalization is restricted to topical preference. We found that users do not uniformly prefer simple texts, and that the text comprehensibility level should match the user's level of preparedness. Consequently, we propose to model the comprehensibility of texts as well as the users' reading proficiency in order to better explain how different users choose content for further exploration. We also model topic-specific reading proficiency, which allows us to better explain why a physician might choose to read sophisticated medical articles yet simple descriptions of SLR cameras. We explore different ways to build user profiles, and use collaborative filtering techniques to overcome data sparsity. We conducted experiments on large-scale datasets from a major Web search engine and a community question answering forum. Our findings confirm that explicitly modeling text comprehensibility can significantly improve content ranking (search results or answers, respectively).","additional_locations":{"location":["http:\/\/portal.acm.org\/citation.cfm?id=2124325","http:\/\/dx.doi.org\/10.1145\/2124295.2124325","http:\/\/www.citeulike.org\/user\/anonyuser2b\/article\/11479394","http:\/\/www.citeulike.org\/user\/anonyuser2b\/article\/11479394","http:\/\/pubget.com\/search?q=doi:10.1145%2F2124295.2124325","http:\/\/www.ncbi.nlm.nih.gov\/pubmed?term=10.1145%2F2124295.2124325[aid]&cmd=DetailsSearch"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser2b\/author\/Tan:C","name":"Chenhao Tan"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser2b\/author\/Gabrilovich:E","name":"Evgeniy Gabrilovich"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser2b\/author\/Pang:B","name":"Bo Pang"}]},"source":{"mm_name":"source","title":"In Proceedings of the fifth ACM international conference on Web search and data mining (2012), pp. 233-242, doi:10.1145\/2124295.2124325ￂﾠ Key: citeulike:11479394"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser2b\/tag\/no-tag","title":"no-tag"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","location":"http:\/\/dx.doi.org\/10.1145\/2124295.2124325","title":"To each his own: personalized content selection based on text comprehensibility"}}}