{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser5a\/article\/618204","title":"SERF: integrating human recommendations with search","abstract":"Today's university library has many digitally accessible resources, both indexes to content and considerable original content. Using off-the-shelf search technology provides a single point of access into library resources, but we have found that such full-text indexing technology is not entirely satisfactory for library searching. In response to this, we report initial usage results from a prototype of an entirely new type of search engine - The System for Electronic Recommendation Filtering (SERF) - that we have designed and deployed for the Oregon State University (OSU) Libraries. SERF encourages users to enter longer and more informative queries, and collects ratings from users as to whether search results meet their information need or not. These ratings are used to make recommendations to later users with similar needs. Over time, SERF learns from the users what documents are valuable for what information needs. In this paper, we focus on understanding whether such recommendations can increase other users' search efficiency and effectiveness in library website searching. Based on examination of three months of usage as an alternative search interface available to all users of the Oregon State University Libraries website (http:\/\/osulibrary.oregonstate.edu\/), we found strong evidence that the recommendations with human evaluation could increase the efficiency as well as effectiveness of the library website search process. Those users who received recommendations needed to examine fewer results, and recommended documents were rated much higher than documents returned by a traditional search engine.","additional_locations":{"location":["http:\/\/portal.acm.org\/citation.cfm?id=1031171.1031277","http:\/\/dx.doi.org\/10.1145\/1031171.1031277","http:\/\/www.citeulike.org\/user\/anonyuser5a\/article\/618204","http:\/\/www.citeulike.org\/user\/anonyuser5a\/article\/618204","http:\/\/pubget.com\/search?q=doi:10.1145%2F1031171.1031277","http:\/\/www.ncbi.nlm.nih.gov\/pubmed?term=10.1145%2F1031171.1031277[aid]&cmd=DetailsSearch"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser5a\/author\/Jung:S","name":"Seikyung Jung"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser5a\/author\/Harris:K","name":"Kevin Harris"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser5a\/author\/Webster:J","name":"Janet Webster"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser5a\/author\/Herlocker:JL","name":"Jonathan L. Herlocker"}]},"source":{"mm_name":"source","title":"In Proceedings of the thirteenth ACM international conference on Information and knowledge management (2004), pp. 571-580, doi:10.1145\/1031171.1031277ￂﾠ Key: citeulike:618204"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser5a\/tag\/no-tag","title":"no-tag"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","location":"http:\/\/dx.doi.org\/10.1145\/1031171.1031277","title":"SERF: integrating human recommendations with search"}}}