{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser5b\/article\/6402570","title":"Ranking model adaptation for domain-specific search","abstract":"Recently, various domain-specific search engines emerge, which are restricted to specific topicalities or document formats, and vertical to the broad-based search. Simply applying the ranking model trained for the broad-based search to the verticals cannot achieve a sound performance due to the domain differences, while building different ranking models for each domain is both laborious for labeling sufficient training samples and time-consuming or the training process. In this paper, to address the above difficulties, we investigate two problems: (1) whether we can adapt the ranking model learned for existing Web page search or verticals, to the new domain, so that the amount of labeled data and the training cost is reduced, while the performance requirement is still satisfied; and (2) how to adapt the ranking model from auxiliary domains to a new target domain. We address the second problem from the regularization framework and an algorithm called ranking adaptation SVM is proposed. Our algorithm is flexible enough, which needs only the prediction from the existing ranking model, rather than the internal representation of the model or the data from auxiliary domains. The first problem is addressed by the proposed ranking adaptability measurement, which quantitatively estimates if an existing ranking model can be adapted to the new domain. Extensive experiments are performed over Letor benchmark dataset and two large scale datasets crawled from different domains through a commercial internet search engine, where the ranking model learned for one domain will be adapted to the other. The results demonstrate the applicabilities of the proposed ranking model adaptation algorithm and the ranking adaptability measurement.","additional_locations":{"location":["http:\/\/portal.acm.org\/citation.cfm?id=1645953.1645980","http:\/\/dx.doi.org\/10.1145\/1645953.1645980","http:\/\/www.citeulike.org\/user\/anonyuser5b\/article\/6402570","http:\/\/www.citeulike.org\/user\/anonyuser5b\/article\/6402570","http:\/\/pubget.com\/search?q=doi:10.1145%2F1645953.1645980","http:\/\/www.ncbi.nlm.nih.gov\/pubmed?term=10.1145%2F1645953.1645980[aid]&cmd=DetailsSearch"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser5b\/author\/Geng:B","name":"Bo Geng"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser5b\/author\/Yang:L","name":"Linjun Yang"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser5b\/author\/Xu:C","name":"Chao Xu"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser5b\/author\/Hua:XS","name":"Xian S. Hua"}]},"source":{"mm_name":"source","title":"In Proceedings of the 18th ACM conference on Information and knowledge management (2009), pp. 197-206, doi:10.1145\/1645953.1645980ￂﾠ Key: citeulike:6402570"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser5b\/tag\/no-tag","title":"no-tag"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","location":"http:\/\/dx.doi.org\/10.1145\/1645953.1645980","title":"Ranking model adaptation for domain-specific search"}}}