{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser2b\/article\/6129606","title":"Analyzing and evaluating query reformulation strategies in web search logs","abstract":"Users frequently modify a previous search query in hope of retrieving better results. These modifications are called query reformulations or query refinements. Existing research has studied how web search engines can propose reformulations, but has given less attention to how people perform query reformulations. In this paper, we aim to better understand how web searchers refine queries and form a theoretical foundation for query reformulation. We study users' reformulation strategies in the context of the AOL query logs. We create a taxonomy of query refinement strategies and build a high precision rule-based classifier to detect each type of reformulation. Effectiveness of reformulations is measured using user click behavior. Most reformulation strategies result in some benefit to the user. Certain strategies like add\/remove words, word substitution, acronym expansion, and spelling correction are more likely to cause clicks, especially on higher ranked results. In contrast, users often click the same result as their previous query or select no results when forming acronyms and reordering words. Perhaps the most surprising finding is that some reformulations are better suited to helping users when the current results are already fruitful, while other reformulations are more effective when the results are lacking. Our findings inform the design of applications that can assist searchers; examples are described in this paper.","additional_locations":{"location":["http:\/\/portal.acm.org\/citation.cfm?id=1645953.1645966","http:\/\/dx.doi.org\/10.1145\/1645953.1645966","http:\/\/www.citeulike.org\/user\/anonyuser2b\/article\/6129606","http:\/\/www.citeulike.org\/user\/anonyuser2b\/article\/6129606","http:\/\/pubget.com\/search?q=doi:10.1145%2F1645953.1645966","http:\/\/www.ncbi.nlm.nih.gov\/pubmed?term=10.1145%2F1645953.1645966[aid]&cmd=DetailsSearch"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser2b\/author\/Huang:J","name":"Jeff Huang"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser2b\/author\/Efthimiadis:EN","name":"Efthimis N. Efthimiadis"}]},"source":{"mm_name":"source","title":"In Proceedings of the 18th ACM conference on Information and knowledge management (2009), pp. 77-86, doi:10.1145\/1645953.1645966ￂﾠ Key: citeulike:6129606"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser2b\/tag\/no-tag","title":"no-tag"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","location":"http:\/\/dx.doi.org\/10.1145\/1645953.1645966","title":"Analyzing and evaluating query reformulation strategies in web search logs"}}}