{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser13b\/article\/11560149","title":"Detecting quilted web pages at scale","abstract":"Web-based advertising and electronic commerce, combined with the key role of search engines in driving visitors to ad-monetized and e-commerce web sites, has given rise to the phenomenon of web spam: web pages that are of little value to visitors, but that are created mainly to mislead search engines into driving traffic to target web sites. A large fraction of spam web pages is automatically generated, and some portion of these pages is generated by stitching together parts (sentences or paragraphs) of other web pages. This paper presents a scalable algorithm for detecting such \"quilted\" web pages. Previous work by the author and his collaborators introduced a sampling-based algorithm that was capable of detecting some, but by far not all quilted web pages in a collection. By contrast, the algorithm presented in this work identifies all quilted web pages, and it is scalable to very large corpora. We tested the algorithm on the half-billion page English-language subset of the ClueWeb09 collection, and evaluated its effectiveness in detecting web spam by manually inspecting small samples of the detected quilted pages. This manual inspection guided us in iteratively refining the algorithm to be more efficient in detecting real-world spam.","additional_locations":{"location":["http:\/\/portal.acm.org\/citation.cfm?id=2348337","http:\/\/dx.doi.org\/10.1145\/2348283.2348337","http:\/\/www.citeulike.org\/user\/anonyuser13b\/article\/11560149","http:\/\/www.citeulike.org\/user\/anonyuser13b\/article\/11560149","http:\/\/pubget.com\/search?q=doi:10.1145%2F2348283.2348337","http:\/\/www.ncbi.nlm.nih.gov\/pubmed?term=10.1145%2F2348283.2348337[aid]&cmd=DetailsSearch"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser13b\/author\/Najork:M","name":"Marc Najork"}]},"source":{"mm_name":"source","title":"In Proceedings of the 35th international ACM SIGIR conference on Research and development in information retrieval (2012), pp. 385-394, doi:10.1145\/2348283.2348337ￂﾠ Key: citeulike:11560149"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser13b\/tag\/no-tag","title":"no-tag"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","location":"http:\/\/dx.doi.org\/10.1145\/2348283.2348337","title":"Detecting quilted web pages at scale"}}}