{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser8a\/article\/11531785","title":"A generalized hidden Markov model with discriminative training for query spelling correction","abstract":"Query spelling correction is a crucial component of modern search engines. Existing methods in the literature for search query spelling correction have two major drawbacks. First, they are unable to handle certain important types of spelling errors, such as concatenation and splitting. Second, they cannot efficiently evaluate all the candidate corrections due to the complex form of their scoring functions, and a heuristic filtering step must be applied to select a working set of top-K most promising candidates for final scoring, leading to non-optimal predictions. In this paper we address both limitations and propose a novel generalized Hidden Markov Model with discriminative training that can not only handle all the major types of spelling errors, including splitting and concatenation errors, in a single unified framework, but also efficiently evaluate all the candidate corrections to ensure the finding of a globally optimal correction. Experiments on two query spelling correction datasets demonstrate that the proposed generalized HMM is effective for correcting multiple types of spelling errors. The results also show that it significantly outperforms the current approach for generating top-K candidate corrections, making it a better first-stage filter to enable any other complex spelling correction algorithm to have access to a better working set of candidate corrections as well as to cover splitting and concatenation errors, which no existing method in academic literature can correct.","additional_locations":{"location":["http:\/\/portal.acm.org\/citation.cfm?id=2348365","http:\/\/dx.doi.org\/10.1145\/2348283.2348365","http:\/\/www.citeulike.org\/user\/anonyuser8a\/article\/11531785","http:\/\/www.citeulike.org\/user\/anonyuser8a\/article\/11531785","http:\/\/pubget.com\/search?q=doi:10.1145%2F2348283.2348365","http:\/\/www.ncbi.nlm.nih.gov\/pubmed?term=10.1145%2F2348283.2348365[aid]&cmd=DetailsSearch"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser8a\/author\/Li:Y","name":"Yanen Li"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser8a\/author\/Duan:H","name":"Huizhong Duan"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser8a\/author\/Zhai:C","name":"ChengXiang Zhai"}]},"source":{"mm_name":"source","title":"In Proceedings of the 35th international ACM SIGIR conference on Research and development in information retrieval (2012), pp. 611-620, doi:10.1145\/2348283.2348365ￂﾠ Key: citeulike:11531785"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser8a\/tag\/no-tag","title":"no-tag"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","location":"http:\/\/dx.doi.org\/10.1145\/2348283.2348365","title":"A generalized hidden Markov model with discriminative training for query spelling correction"}}}