{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser2b\/article\/11527908","title":"A Bayesian approach for structural learning with hidden Markov models","abstract":"Hidden Markov Models(HMM) have proved to be a successful modeling paradigm for dynamic and spatial processes in many domains, such as speech recognition, genomics, and general sequence alignment. Typically, in these applications, the model structures are predefined by domain experts. Therefore, the HMM learning problem focuses on the learning of the parameter values of the model to fit the given data sequences. However, when one considers other domains, such as, economics and physiology, model structure capturing the system dynamic behavior is not available. In order to successfully apply the HMM methodology in these domains, it is important that a mechanism is available for automatically deriving the model structure from the data. This paper presents a HMM learning procedure that simultaneously learns the model structure and the maximum likelihood parameter values of a HMM from data. The HMM model structures are derived based on the Bayesian model selection methodology. In addition, we introduce a new initialization procedure for HMM parameter value estimation based on the K-means clustering method. Experimental results with artificially generated data show the effectiveness of the approach.","additional_locations":{"location":["http:\/\/portal.acm.org\/citation.cfm?id=1239968","http:\/\/www.citeulike.org\/user\/anonyuser2b\/article\/11527908","http:\/\/www.citeulike.org\/user\/anonyuser2b\/article\/11527908"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser2b\/author\/Li:C","name":"Cen Li"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser2b\/author\/Biswas:G","name":"Gautam Biswas"}]},"source":{"mm_name":"source","title":"Sci. Program., Vol. 10, No. 3. (August 2002), pp. 201-219ￂﾠ Key: citeulike:11527908"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser2b\/tag\/no-tag","title":"no-tag"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","title":"A Bayesian approach for structural learning with hidden Markov models"}}}