{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser10b\/article\/8492720","title":"A unified representation of web logs for mining applications","abstract":"The collective feedback of the users of an Information Retrieval (IR) system has been shown to provide semantic information that, while hard to extract using standard IR techniques, can be useful in Web mining tasks. In the last few years, several approaches have been proposed to process the logs stored by Internet Service Providers (ISP), Intranet proxies or Web search engines. However, the solutions proposed in the literature only partially represent the information available in the Web logs. In this paper, we propose to use a richer data structure, which is able to preserve most of the information available in the Web logs. This data structure consists of three groups of entities: users, documents and queries, which are connected in a network of relations. Query refinements correspond to separate transitions between the corresponding query nodes in the graph, while users are linked to the queries they have issued and to the documents they have selected. The classical query\/document transitions, which connect a query to the documents selected by the users' in the returned result page, are also considered. The resulting data structure is a complete representation of the collective search activity performed by the users of a search engine or of an Intranet. The experimental results show that this more powerful representation can be successfully used in several Web mining tasks like discovering semantically relevant query suggestions and Web page categorization by topic.","additional_locations":{"location":["http:\/\/portal.acm.org\/citation.cfm?id=1997498","http:\/\/dx.doi.org\/10.1007\/s10791-010-9160-6","http:\/\/www.springerlink.com\/content\/g03q3h81124qqgq2","http:\/\/www.citeulike.org\/user\/anonyuser10b\/article\/8492720","http:\/\/www.citeulike.org\/user\/anonyuser10b\/article\/8492720","http:\/\/pubget.com\/search?q=doi:10.1007%2Fs10791-010-9160-6","http:\/\/www.ncbi.nlm.nih.gov\/pubmed?term=10.1007%2Fs10791-010-9160-6[aid]&cmd=DetailsSearch"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser10b\/author\/Diligenti:M","name":"Michelangelo Diligenti"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser10b\/author\/Gori:M","name":"Marco Gori"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser10b\/author\/Maggini:M","name":"Marco Maggini"}]},"source":{"mm_name":"source","title":"Inf. Retr., Vol. 14, No. 3. (15 June 2011), pp. 215-236, doi:10.1007\/s10791-010-9160-6ￂﾠ Key: citeulike:8492720"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser10b\/tag\/no-tag","title":"no-tag"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","location":"http:\/\/dx.doi.org\/10.1007\/s10791-010-9160-6","title":"A unified representation of web logs for mining applications"}}}