{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser2a\/article\/11527828","title":"Metadata Based Web Mining for Topic-Specific Information Gathering","abstract":"As the World-Wide-Web grows at an exponential rate, we are faced with the issue of rating pages in terms of quality and trust. In this siutation, with significant linkage among web pages, what other pages say about a web page can be as important as and more objective than what the page says about itself. The cumulative knowledge of such recommendations (or lack of them) can help a system to decide whether to pursue a page or not. This metadata information can also be used by a web robot program, for example, to derive summary information about web documents written in a foreign language. In this paper, we describe how we exploit this type of metadata to drive a web information gathering system, which forms the backend of a topic-specific search engine. The system uses metadata from hyperlinks to guide itself to crawl the web staying focused on a target topic. The crawler follows links that point to information related to the topic and avoids following links to irrelevant pages. Moreover, the system uses the metadata to improve its definition of the target topic through association mining. Ultimately, the guided crawling system builds a rich repository of metadata information, which is used to serve the search engine.","additional_locations":{"location":["http:\/\/portal.acm.org\/citation.cfm?id=680178","http:\/\/www.citeulike.org\/user\/anonyuser2a\/article\/11527828","http:\/\/www.citeulike.org\/user\/anonyuser2a\/article\/11527828"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser2a\/author\/Yi:J","name":"Jeonghee Yi"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser2a\/author\/Sundaresan:N","name":"Neel Sundaresan"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser2a\/author\/Huang:A","name":"Anital Huang"}]},"source":{"mm_name":"source","title":"In Proceedings of the First International Conference on Electronic Commerce and Web Technologies (2000)ￂﾠ Key: citeulike:11527828"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser2a\/tag\/exp","title":"exp"},{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser2a\/tag\/new","title":"new"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","title":"Metadata Based Web Mining for Topic-Specific Information Gathering"}}}