{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser10b\/article\/11534102","title":"Synthesizing high utility suggestions for rare web search queries","abstract":"Search engines are continuously looking into methods to alleviate users' effort in finding desired information. For this, all major search engines employ query suggestions methods to facilitate effective query formulation and reformulation. Providing high quality query suggestions is a critical task for search engines and so far most research efforts have focused on tapping various information available in search query logs to identify potential suggestions. By relying on this single source of information, suggestion providing systems often restrict themselves to only previously observed query sessions. Therefore, a critical challenge faced by query suggestions provision mechanism is that of coverage, i.e., the number of unique queries for which users are provided with suggestions, while keeping the suggestion quality high. To address this problem, we propose a novel way of generating suggestions for user search queries by moving beyond the dependency on search query logs and providing synthetic suggestions for web search queries. The key challenges in providing synthetic suggestions include identifying important concepts in a query and systematically exploring related concepts while ensuring that the resulting suggestions are relevant to the user query and of high utility. We present an end-to-end system to generate synthetic suggestions that builds upon novel query-level operations and combines information available from various textual sources. We evaluate our suggestion system over a large-scale real-world dataset of query logs and show that our methods increase the coverage of query-suggestion pairs by up to 39% without compromising the quality or the utility of the suggestions.","additional_locations":{"location":["http:\/\/portal.acm.org\/citation.cfm?id=2010024","http:\/\/dx.doi.org\/10.1145\/2009916.2010024","http:\/\/www.citeulike.org\/user\/anonyuser10b\/article\/11534102","http:\/\/www.citeulike.org\/user\/anonyuser10b\/article\/11534102","http:\/\/pubget.com\/search?q=doi:10.1145%2F2009916.2010024","http:\/\/www.ncbi.nlm.nih.gov\/pubmed?term=10.1145%2F2009916.2010024[aid]&cmd=DetailsSearch"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser10b\/author\/Jain:A","name":"Alpa Jain"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser10b\/author\/Ozertem:U","name":"Umut Ozertem"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser10b\/author\/Velipasaoglu:E","name":"Emre Velipasaoglu"}]},"source":{"mm_name":"source","title":"In Proceedings of the 34th international ACM SIGIR conference on Research and development in Information Retrieval (2011), pp. 805-814, doi:10.1145\/2009916.2010024ￂﾠ Key: citeulike:11534102"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser10b\/tag\/no-tag","title":"no-tag"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","location":"http:\/\/dx.doi.org\/10.1145\/2009916.2010024","title":"Synthesizing high utility suggestions for rare web search queries"}}}