{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser8a\/article\/11531842","title":"Unsupervised extraction of template structure in web search queries","abstract":"Web search queries are an encoding of the user's search intent and extracting structured information from them can facilitate central search engine operations like improving the ranking of search results and advertisements. Not surprisingly, this area has attracted a lot of attention in the research community in the last few years. The problem is, however, made challenging by the fact that search queries tend to be extremely succinct; a condensation of user search needs to the bare-minimum set of keywords. In this paper we consider the problem of extracting, with no manual intervention, the hidden structure behind the observed search queries in a domain: the origins of the constituent keywords as well as the manner the individual keywords are assembled together. We formalize important properties of the problem and then give a principled solution based on generative models that satisfies these properties. Using manually labeled data we show that the query templates extracted by our solution are superior to those discovered by strong baseline methods. The query templates extracted by our approach have potential uses in many search engine tasks; query answering, advertisement matching and targeting, to name a few. In this paper we study one such task, estimating Query-Advertisability, and empirically demonstrate that using extracted template information can improve performance over and above the current state-of-the-art.","additional_locations":{"location":["http:\/\/portal.acm.org\/citation.cfm?id=2187892","http:\/\/dx.doi.org\/10.1145\/2187836.2187892","http:\/\/www.citeulike.org\/user\/anonyuser8a\/article\/11531842","http:\/\/www.citeulike.org\/user\/anonyuser8a\/article\/11531842","http:\/\/pubget.com\/search?q=doi:10.1145%2F2187836.2187892","http:\/\/www.ncbi.nlm.nih.gov\/pubmed?term=10.1145%2F2187836.2187892[aid]&cmd=DetailsSearch"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser8a\/author\/Pandey:S","name":"Sandeep Pandey"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser8a\/author\/Punera:K","name":"Kunal Punera"}]},"source":{"mm_name":"source","title":"In Proceedings of the 21st international conference on World Wide Web (2012), pp. 409-418, doi:10.1145\/2187836.2187892ￂﾠ Key: citeulike:11531842"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser8a\/tag\/no-tag","title":"no-tag"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","location":"http:\/\/dx.doi.org\/10.1145\/2187836.2187892","title":"Unsupervised extraction of template structure in web search queries"}}}