{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser8a\/article\/11531865","title":"Candidate document retrieval for web-scale text reuse detection","abstract":"Given a document d, the task of text reuse detection is to find those passages in d which in identical or paraphrased form also appear in other documents. To solve this problem at web-scale, keywords representing d's topics have to be combined to web queries. The retrieved web documents can then be delivered to a text reuse detection system for an in-depth analysis. We focus on the query formulation problem as the crucial first step in the detection process and present a new query formulation strategy that achieves convincing results: compared to a maximal termset query formulation strategy [10, 14], which is the most sensible non-heuristic baseline, we save on average 70% of the queries in realistic experiments. With respect to the candidate documents' quality, our heuristic retrieves documents that are, on average, more similar to the given document than the results of previously published query formulation strategies [4, 8].","additional_locations":{"location":["http:\/\/portal.acm.org\/citation.cfm?id=2051108","http:\/\/www.citeulike.org\/user\/anonyuser8a\/article\/11531865","http:\/\/www.citeulike.org\/user\/anonyuser8a\/article\/11531865"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser8a\/author\/Hagen:M","name":"Matthias Hagen"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser8a\/author\/Stein:B","name":"Benno Stein"}]},"source":{"mm_name":"source","title":"In Proceedings of the 18th international conference on String processing and information retrieval (2011), pp. 356-367ￂﾠ Key: citeulike:11531865"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser8a\/tag\/no-tag","title":"no-tag"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","title":"Candidate document retrieval for web-scale text reuse detection"}}}