{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser5a\/article\/832829","title":"Item-based top-<i>N<\/i> recommendation algorithms","abstract":"The explosive growth of the world-wide-web and the emergence of e-commerce has led to the development of recommender systems---a personalized information filtering technology used to identify a set of items that will be of interest to a certain user. User-based collaborative filtering is the most successful technology for building recommender systems to date and is extensively used in many commercial recommender systems. Unfortunately, the computational complexity of these methods grows linearly with the number of customers, which in typical commercial applications can be several millions. To address these scalability concerns model-based recommendation techniques have been developed. These techniques analyze the user--item matrix to discover relations between the different items and use these relations to compute the list of recommendations.In this article, we present one such class of model-based recommendation algorithms that first determines the similarities between the various items and then uses them to identify the set of items to be recommended. The key steps in this class of algorithms are (i) the method used to compute the similarity between the items, and (ii) the method used to combine these similarities in order to compute the similarity between a basket of items and a candidate recommender item. Our experimental evaluation on eight real datasets shows that these item-based algorithms are up to two orders of magnitude faster than the traditional user-neighborhood based recommender systems and provide recommendations with comparable or better quality.","additional_locations":{"location":["http:\/\/portal.acm.org\/citation.cfm?id=963776","http:\/\/dblp.uni-trier.de\/rec\/bibtex\/journals\/tois\/DeshpandeK04","http:\/\/dx.doi.org\/10.1145\/963770.963776","http:\/\/www.citeulike.org\/user\/anonyuser5a\/article\/832829","http:\/\/www.citeulike.org\/user\/anonyuser5a\/article\/832829","http:\/\/pubget.com\/search?q=doi:10.1145%2F963770.963776","http:\/\/www.ncbi.nlm.nih.gov\/pubmed?term=10.1145%2F963770.963776[aid]&cmd=DetailsSearch"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser5a\/author\/Deshpande:M","name":"Mukund Deshpande"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser5a\/author\/Karypis:G","name":"George Karypis"}]},"source":{"mm_name":"source","title":"ACM Trans. Inf. Syst., Vol. 22, No. 1. (January 2004), pp. 143-177, doi:10.1145\/963770.963776ￂﾠ Key: citeulike:832829"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser5a\/tag\/no-tag","title":"no-tag"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","location":"http:\/\/dx.doi.org\/10.1145\/963770.963776","title":"Item-based top-<i>N<\/i> recommendation algorithms"}}}