{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser10b\/article\/11534129","title":"Mining GPS traces and visual words for event classification","abstract":"It is of great interest to recognize semantic events (e.g., hiking, skiing, party), in particular when given a collection of personal photos, where each photo is tagged with a timestamp and GPS (Global Positioning System) information at the capture. We address this emerging multiclass classification problem by mining informative features derived from traces of GPS coordinates and a bag of visual words, both based on the entire collection as opposed to individual photos. Considering that semantic events are best characterized by a compositional description of the visual content in terms of the co-occurrence of objects and scenes, we focus on mining compositional features (equivalent to word combinations in the \"bag-of-words\" method) that have better discriminative and descriptive abilities than individual features. In order to handle the combinatorial complexity in discovering such compositional features, we apply a data mining method based on frequent itemset mining (FIM). Complementary features are also derived from GPS traces and mined to characterize the underlying movement patterns of various event types. Upon compositional feature mining, we perform multiclass AdaBoost to solve the multiclass problem. Based on a dataset of eight event classes and a total of more than 3000 geotagged images from 88 events, experimental results using leave-one-out cross validation have shown the synergy of all of the components in our proposed approach to event classification.","additional_locations":{"location":["http:\/\/portal.acm.org\/citation.cfm?id=1460099","http:\/\/dx.doi.org\/10.1145\/1460096.1460099","http:\/\/www.citeulike.org\/user\/anonyuser10b\/article\/11534129","http:\/\/www.citeulike.org\/user\/anonyuser10b\/article\/11534129","http:\/\/pubget.com\/search?q=doi:10.1145%2F1460096.1460099","http:\/\/www.ncbi.nlm.nih.gov\/pubmed?term=10.1145%2F1460096.1460099[aid]&cmd=DetailsSearch"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser10b\/author\/Yuan:J","name":"Junsong Yuan"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser10b\/author\/Luo:J","name":"Jiebo Luo"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser10b\/author\/Kautz:H","name":"Henry Kautz"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser10b\/author\/Wu:Y","name":"Ying Wu"}]},"source":{"mm_name":"source","title":"In Proceedings of the 1st ACM international conference on Multimedia information retrieval (2008), pp. 2-9, doi:10.1145\/1460096.1460099ￂﾠ Key: citeulike:11534129"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser10b\/tag\/no-tag","title":"no-tag"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","location":"http:\/\/dx.doi.org\/10.1145\/1460096.1460099","title":"Mining GPS traces and visual words for event classification"}}}