{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser14a\/article\/11594043","title":"Efficient query recommendations in the long tail via center-piece subgraphs","abstract":"We present a recommendation method based on the well-known concept of center-piece subgraph, that allows for the time\/space efficient generation of suggestions also for rare, i.e., long-tail queries. Our method is scalable with respect to both the size of datasets from which the model is computed and the heavy workloads that current web search engines have to deal with. Basically, we relate terms contained into queries with highly correlated queries in a query-flow graph. This enables a novel recommendation generation method able to produce recommendations for approximately 99% of the workload of a real-world search engine. The method is based on a graph having term nodes, query nodes, and two kinds of connections: term-query and query-query. The first connects a term to the queries in which it is contained, the second connects two query nodes if the likelihood that a user submits the second query after having issued the first one is sufficiently high. On such large graph we need to compute the center-piece subgraph induced by terms contained into queries. In order to reduce the cost of the above computation, we introduce a novel and efficient method based on an inverted index representation of the model. We experiment our solution on two real-world query logs and we show that its effectiveness is comparable (and in some case better) than state-of-the-art methods for head-queries. More importantly, the quality of the recommendations generated remains very high also for long-tail queries, where other methods fail even to produce any suggestion. Finally, we extensively investigate scalability and efficiency issues and we show the viability of our method in real world search engines.","additional_locations":{"location":["http:\/\/portal.acm.org\/citation.cfm?id=2348332","http:\/\/dx.doi.org\/10.1145\/2348283.2348332","http:\/\/www.citeulike.org\/user\/anonyuser14a\/article\/11594043","http:\/\/www.citeulike.org\/user\/anonyuser14a\/article\/11594043","http:\/\/pubget.com\/search?q=doi:10.1145%2F2348283.2348332","http:\/\/www.ncbi.nlm.nih.gov\/pubmed?term=10.1145%2F2348283.2348332[aid]&cmd=DetailsSearch"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser14a\/author\/Bonchi:F","name":"Francesco Bonchi"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser14a\/author\/Perego:R","name":"Raffaele Perego"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser14a\/author\/Silvestri:F","name":"Fabrizio Silvestri"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser14a\/author\/Vahabi:H","name":"Hossein Vahabi"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser14a\/author\/Venturini:R","name":"Rossano Venturini"}]},"source":{"mm_name":"source","title":"In Proceedings of the 35th international ACM SIGIR conference on Research and development in information retrieval (2012), pp. 345-354, doi:10.1145\/2348283.2348332ￂﾠ Key: citeulike:11594043"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser14a\/tag\/no-tag","title":"no-tag"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","location":"http:\/\/dx.doi.org\/10.1145\/2348283.2348332","title":"Efficient query recommendations in the long tail via center-piece subgraphs"}}}