{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser1b\/article\/11492881","title":"Topic-sensitive PageRank: a context-sensitive ranking algorithm for Web search","abstract":"The original PageRank algorithm for improving the ranking of search-query results computes a single vector, using the link structure of the Web, to capture the relative \"importance\" of Web pages, independent of any particular search query. To yield more accurate search results, we propose computing a set of PageRank vectors, biased using a set of representative topics, to capture more accurately the notion of importance with respect to a particular topic. For ordinary keyword search queries, we compute the topic-sensitive PageRank scores for pages satisfying the query using the topic of the query keywords. For searches done in context (e.g., when the search query is performed by highlighting words in a Web page), we compute the topic-sensitive PageRank scores using the topic of the context in which the query appeared. By using linear combinations of these (precomputed) biased PageRank vectors to generate context-specific importance scores for pages at query time, we show that we can generate more accurate rankings than with a single, generic PageRank vector. We describe techniques for efficiently implementing a large-scale search system based on the topic-sensitive PageRank scheme.","additional_locations":{"location":["http:\/\/dx.doi.org\/10.1109\/TKDE.2003.1208999","http:\/\/www.citeulike.org\/user\/anonyuser1b\/article\/11492881","http:\/\/www.citeulike.org\/user\/anonyuser1b\/article\/11492881","http:\/\/pubget.com\/search?q=doi:10.1109%2FTKDE.2003.1208999","http:\/\/www.ncbi.nlm.nih.gov\/pubmed?term=10.1109%2FTKDE.2003.1208999[aid]&cmd=DetailsSearch"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser1b\/author\/Haveliwala:TH","name":"T. H. Haveliwala"}]},"source":{"mm_name":"source","title":"Knowledge and Data Engineering, IEEE Transactions on, Vol. 15, No. 4. (July 2003), doi:10.1109\/TKDE.2003.1208999ￂﾠ Key: citeulike:11492881"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser1b\/tag\/no-tag","title":"no-tag"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","location":"http:\/\/dx.doi.org\/10.1109\/TKDE.2003.1208999","title":"Topic-sensitive PageRank: a context-sensitive ranking algorithm for Web search"}}}