{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser4b\/article\/11506328","title":"Searching for Images and Videos on the World-Wide Web","abstract":"We describe a prototype visual information system for searching for images and videos on the World-Wide Web. New visual information in the form of images, graphics, animations and videos is being published on the Web at an incredible rate. However, cataloging this visual data is beyond the capabilities of current text-based Web search engines. The key to cataloging it is the marriage of text-based processing and content-based visual analysis of the images and videos. In this paper, we describe a complete system by which visual information on the Web is (1) collected by automated agents, (2) processed in both text and visual feature domains, (3) catalogued and (4) indexed for fast search and retrieval. We introduce an image and video search engine which utilizes both text-based navigation and content-based technology for searching visually through the catalogued images and videos. Finally, we provide an initial evaluation based upon the cataloging of over one half million images and videos collected from the Web. Keywords  content-based visual query, image and video storage and retrieval, World-Wide Web. John R. Smith and Shih-Fu Chang 1 1","additional_locations":{"location":["http:\/\/citeseerx.ist.psu.edu\/viewdoc\/summary?doi=10.1.1.106.2400","http:\/\/www.citeulike.org\/user\/anonyuser4b\/article\/11506328","http:\/\/www.citeulike.org\/user\/anonyuser4b\/article\/11506328"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser4b\/author\/Smith:JR","name":"John R. Smith"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser4b\/author\/Chang:S","name":"Shih-fu Chang"}]},"source":{"mm_name":"source","title":"(1996)ￂﾠ Key: citeulike:11506328"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser4b\/tag\/no-tag","title":"no-tag"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","title":"Searching for Images and Videos on the World-Wide Web"}}}