{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser2a\/article\/11527830","title":"Accurate and efficient crawling for relevant websites","abstract":"Focused web crawlers have recently emerged as an alternative to the well-established web search engines. While the well-known focused crawlers retrieve relevant webpages, there are various applications which target whole websites instead of single webpages. For example, companies are represented by websites, not by individual webpages. To answer queries targeted at websites, web directories are an established solution. In this paper, we introduce a novel focused website crawler to employ the paradigm of focused crawling for the search of relevant websites. The proposed crawler is based on a two-level architecture and corresponding crawl strategies with an explicit concept of websites. The external crawler views the web as a graph of linked websites, selects the websites to be examined next and invokes internal crawlers. Each internal crawler views the webpages of a single given website and performs focused (page) crawling within that website. Our experimental evaluation demonstrates that the proposed focused website crawler clearly outperforms previous methods of focused crawling which were adapted to retrieve websites instead of single webpages.","additional_locations":{"location":["http:\/\/portal.acm.org\/citation.cfm?id=1316725","http:\/\/www.citeulike.org\/user\/anonyuser2a\/article\/11527830","http:\/\/www.citeulike.org\/user\/anonyuser2a\/article\/11527830"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser2a\/author\/Ester:M","name":"Martin Ester"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser2a\/author\/Kriegel:HP","name":"Hans P. Kriegel"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser2a\/author\/Schubert:M","name":"Matthias Schubert"}]},"source":{"mm_name":"source","title":"In Proceedings of the Thirtieth international conference on Very large data bases - Volume 30 (2004)ￂﾠ Key: citeulike:11527830"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser2a\/tag\/exp","title":"exp"},{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser2a\/tag\/new","title":"new"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","title":"Accurate and efficient crawling for relevant websites"}}}