{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser11b\/article\/5802807","title":"Hot today, gone tomorrow: on the migration of MySpace users","abstract":"While some empirical studies on Online Social Networks (OSNs) have examined the growth of these systems, little is known about the patterns of decline in user population or user activity (in terms of visiting their OSN account) in large OSNs, mainly because capturing the required information is challenging. In this paper, we examine the evolution of user population and user activity in a popular OSN, namely MySpace. Leveraging more than 360K randomly sampled profiles, we characterize both the pattern of departure and the level of activity among MySpace users. Our main findings can be summarized as follows: (i) A significant fraction of accounts have been deleted and a large fraction of valid accounts have not been visited for more than three months. (ii) One third of public accounts are owned by users who abandon their accounts shortly after creation (i.e., tourists). We leverage this information to estimate the account creation time of other users from their user IDs. (iii) We demonstrate that the growth of allocated user IDs in MySpace was exponential, followed by a sudden and significant slow-down in April 2008 due to an increase in the popularity of Facebook. If such up- and down-turns are symptomatic of OSNs, they raise the obvious question: What are the main forces that enable some systems to compete and strive in the Internet's OSN eco-system, while others decline and ultimately die out?","additional_locations":{"location":["http:\/\/portal.acm.org\/citation.cfm?id=1592665.1592676","http:\/\/dx.doi.org\/10.1145\/1592665.1592676","http:\/\/www.citeulike.org\/user\/anonyuser11b\/article\/5802807","http:\/\/www.citeulike.org\/user\/anonyuser11b\/article\/5802807","http:\/\/pubget.com\/search?q=doi:10.1145%2F1592665.1592676","http:\/\/www.ncbi.nlm.nih.gov\/pubmed?term=10.1145%2F1592665.1592676[aid]&cmd=DetailsSearch"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser11b\/author\/Torkjazi:M","name":"Mojtaba Torkjazi"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser11b\/author\/Rejaie:R","name":"Reza Rejaie"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser11b\/author\/Willinger:W","name":"Walter Willinger"}]},"source":{"mm_name":"source","title":"In Proceedings of the 2nd ACM workshop on Online social networks (2009), pp. 43-48, doi:10.1145\/1592665.1592676ￂﾠ Key: citeulike:5802807"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser11b\/tag\/no-tag","title":"no-tag"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","location":"http:\/\/dx.doi.org\/10.1145\/1592665.1592676","title":"Hot today, gone tomorrow: on the migration of MySpace users"}}}