{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser10b\/article\/11534106","title":"Exploring ant colony optimisation for adaptive interactive search","abstract":"Search engines have become much more interactive in recent years which has triggered a lot of work in automatically acquiring knowledge structures that can assist a user in navigating through a document collection. Query log analysis has emerged as one of the most promising research areas to automatically derive such structures. We explore a biologically inspired model based on ant colony optimisation applied to query logs as an adaptive learning process that addresses the problem of deriving query suggestions. A user interaction with the search engine is treated as an individual ant's journey and over time the collective journeys of all ants result in strengthening more popular paths which leads to a corresponding term association graph that is used to provide query modification suggestions. This association graph is being updated in a continuous learning cycle. In this paper we use a novel automatic evaluation framework based on actual query logs to explore the effect of different parameters in the ant colony optimisation algorithm on the performance of the resulting adaptive query suggestion model. We also use the framework to compare the ant colony approach against a state-of-the-art baseline. The experiments were conducted with query logs collected on a university search engine over a period of several years.","additional_locations":{"location":["http:\/\/portal.acm.org\/citation.cfm?id=2040345","http:\/\/www.citeulike.org\/user\/anonyuser10b\/article\/11534106","http:\/\/www.citeulike.org\/user\/anonyuser10b\/article\/11534106"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser10b\/author\/Albakour:MD","name":"M. Dyaa Albakour"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser10b\/author\/Kruschwitz:U","name":"Udo Kruschwitz"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser10b\/author\/Nanas:N","name":"Nikolaos Nanas"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser10b\/author\/Song:D","name":"Dawei Song"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser10b\/author\/Fasli:M","name":"Maria Fasli"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser10b\/author\/De+Roeck:A","name":"Anne De Roeck"}]},"source":{"mm_name":"source","title":"In Proceedings of the Third international conference on Advances in information retrieval theory (2011), pp. 213-224ￂﾠ Key: citeulike:11534106"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser10b\/tag\/no-tag","title":"no-tag"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","title":"Exploring ant colony optimisation for adaptive interactive search"}}}