{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser2a\/article\/11527833","title":"CI Spider: a tool for competitive intelligence on the web","abstract":"Competitive Intelligence (CI) aims to monitor a firm's external environment for information relevant to its decision-making process. As an excellent information source, the Internet provides significant opportunities for CI professionals as well as the problem of information overload. Internet search engines have been widely used to facilitate information search on the Internet. However, many problems hinder their effective use in CI research. In this paper, we introduce the Competitive Intelligence Spider, or CI Spider, designed to address some of the problems associated with using Internet search engines in the context of competitive intelligence. CI Spider performs real-time collection of Web pages from sites specified by the user and applies indexing and categorization analysis on the documents collected, thus providing the user with an up-to-date, comprehensive view of the Web sites of user interest. In this paper, we report on the design of the CI Spider system and on a user study of CI Spider, which compares CI Spider with two other alternative focused information gathering methods: Lycos search constrained by Internet domain, and manual within-site browsing and searching. Our study indicates that CI Spider has better precision and recall rate than Lycos. CI Spider also outperforms both Lycos and within-site browsing and searching with respect to ease of use. We conclude that there exists strong evidence in support of the potentially significant value of applying the CI Spider approach in CI applications.","additional_locations":{"location":["http:\/\/dx.doi.org\/10.1016\/S0167-9236(02)00002-7","http:\/\/www.citeulike.org\/user\/anonyuser2a\/article\/11527833","http:\/\/www.citeulike.org\/user\/anonyuser2a\/article\/11527833","http:\/\/pubget.com\/search?q=doi:10.1016%2FS0167-9236(02)00002-7","http:\/\/www.ncbi.nlm.nih.gov\/pubmed?term=10.1016%2FS0167-9236(02)00002-7[aid]&cmd=DetailsSearch"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser2a\/author\/Chen:H","name":"Hsinchun Chen"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser2a\/author\/Chau:M","name":"Michael Chau"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser2a\/author\/Zeng:D","name":"Daniel Zeng"}]},"source":{"mm_name":"source","title":"Decis. Support Syst., Vol. 34, No. 1. (December 2002), doi:10.1016\/S0167-9236(02)00002-7ￂﾠ Key: citeulike:11527833"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser2a\/tag\/exp","title":"exp"},{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser2a\/tag\/new","title":"new"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","location":"http:\/\/dx.doi.org\/10.1016\/S0167-9236(02)00002-7","title":"CI Spider: a tool for competitive intelligence on the web"}}}