{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser8b\/article\/3032089","title":"Discovering global network communities based on local centralities","abstract":"One of the central problems in studying and understanding complex networks, such as online social networks or World Wide Web, is to discover hidden, either physically (e.g., interactions or hyperlinks) or logically (e.g., profiles or semantics) well-defined topological structures. From a practical point of view, a good example of such structures would be so-called network communities. Earlier studies have introduced various formulations as well as methods for the problem of identifying or extracting communities. While each of them has pros and cons as far as the effectiveness and efficiency are concerned, almost none of them has explicitly dealt with the potential relationship between the global topological property of a network and the local property of individual nodes. In order to study this problem, this paper presents a new algorithm, called ICS, which aims to discover natural network communities by inferring from the local information of nodes inherently hidden in networks based on a new centrality, that is, clustering centrality, which is a generalization of eigenvector centrality. As compared with existing methods, our method runs efficiently with a good clustering performance. Additionally, it is insensitive to its built-in parameters and prior knowledge.","additional_locations":{"location":["http:\/\/portal.acm.org\/citation.cfm?id=1326561.1326570","http:\/\/dx.doi.org\/10.1145\/1326561.1326570","http:\/\/www.citeulike.org\/user\/anonyuser8b\/article\/3032089","http:\/\/www.citeulike.org\/user\/anonyuser8b\/article\/3032089","http:\/\/pubget.com\/search?q=doi:10.1145%2F1326561.1326570","http:\/\/www.ncbi.nlm.nih.gov\/pubmed?term=10.1145%2F1326561.1326570[aid]&cmd=DetailsSearch"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser8b\/author\/Yang:B","name":"Bo Yang"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser8b\/author\/Liu:J","name":"Jiming Liu"}]},"source":{"mm_name":"source","title":"ACM Trans. Web, Vol. 2, No. 1. (March 2008), pp. 1-32, doi:10.1145\/1326561.1326570ￂﾠ Key: citeulike:3032089"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser8b\/tag\/no-tag","title":"no-tag"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","location":"http:\/\/dx.doi.org\/10.1145\/1326561.1326570","title":"Discovering global network communities based on local centralities"}}}