{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser8b\/article\/11531974","title":"Focused Crawls, Tunneling, and Digital Libraries","abstract":"Crawling the Web to build collections of documents related to pre-specified topics became an active area of research during the late 1990's, crawler technology having been developed for use by search engines. Now, Web crawling is being seriously considered as an important strategy for building large scale digital libraries. This paper covers some of the crawl technologies that might be exploited for collection building. For example, to make such collection-building crawls more effective, focused crawling was developed, in which the goal was to make a \"best-first\" crawl of the Web. We are using powerful crawler software to implement a focused crawl but use tunneling to overcome some of the limitations of a pure best-first approach. Tunneling has been described by others as not only prioritizing links from pages according to the page's relevance score, but also estimating the value of each link and prioritizing them as well. We add to this mix by devising a tunneling focused crawling strategy which evaluates the current crawl direction on the fly to determine when to terminate a tunneling activity. Results indicate that a combination of focused crawling and tunneling could be an effective tool for building digital libraries.","additional_locations":{"location":["http:\/\/portal.acm.org\/citation.cfm?id=700069","http:\/\/www.citeulike.org\/user\/anonyuser8b\/article\/11531974","http:\/\/www.citeulike.org\/user\/anonyuser8b\/article\/11531974"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser8b\/author\/Bergmark:D","name":"Donna Bergmark"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser8b\/author\/Lagoze:C","name":"Carl Lagoze"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser8b\/author\/Sbityakov:A","name":"Alex Sbityakov"}]},"source":{"mm_name":"source","title":"In Proceedings of the 6th European Conference on Research and Advanced Technology for Digital Libraries (2002), pp. 91-106ￂﾠ Key: citeulike:11531974"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser8b\/tag\/no-tag","title":"no-tag"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","title":"Focused Crawls, Tunneling, and Digital Libraries"}}}