{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser4b\/article\/11506332","title":"Natural-language retrieval of images based on descriptive captions","abstract":"We describe a prototype intelligent information retrieval system that uses natural-language understanding to efficiently locate captioned data. Multimedia data generally require captions to explain their features and significance. Such descriptive captions often rely on long nominal compounds (strings of consecutive nouns) which create problems of disambiguating word sense. In our system, captions and user queries are parsed and interpreted to produce a logical form, using a detailed theory of the meaning of nominal compounds. A fine-grain match can then compare the logical form of the query to the logical forms for each caption. To improve system efficiency, we first perform a coarse-grain match with index files, using nouns and verbs extracted from the query. Our experiments with randomly selected queries and captions from an existing image library show an increase of 30 % in precision and 50 % in recall over the keyphrase approach currently used. Our processing times have a median of seven seconds as compared to eight minutes for the existing system, and our system is much easier to use.","additional_locations":{"location":["http:\/\/citeseerx.ist.psu.edu\/viewdoc\/summary?doi=10.1.1.104.2693","http:\/\/www.citeulike.org\/user\/anonyuser4b\/article\/11506332","http:\/\/www.citeulike.org\/user\/anonyuser4b\/article\/11506332"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser4b\/author\/Guglielmo:EJ","name":"Eugene J. Guglielmo"},{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser4b\/author\/Rowe:NC","name":"Neil C. Rowe"}]},"source":{"mm_name":"source","title":"In ACM Transactions on Information Systems (1996), pp. 237-267ￂﾠ Key: citeulike:11506332"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser4b\/tag\/no-tag","title":"no-tag"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","title":"Natural-language retrieval of images based on descriptive captions"}}}