{"citeulike_paper":{"location":"http:\/\/www.citeulike.org\/user\/anonyuser9b\/article\/11534127","title":"Visual analytics in support of education","abstract":"The amount of data about us and our world is increasing rapidly, and the capability to analyze large data sets---so-called big data---becomes a key basis of competition, underpinning new waves of productivity growth and innovation. The big data phenomenon is fueled by cheap sensors and high-throughput simulation models, the increasing volume and detail of information captured by enterprises, the rise of multimedia, social media, and the Internet. It exists from social media to cell biology offering unparalleled opportunities to document the inner workings of many complex systems [1]. Research by MGI and McKinsey's Business Technology Office argues that there will be a shortage of talent necessary for organizations to take advantage of big data. \"By 2018, the United States alone could face a shortage of 140,000 to 190,000 people with deep analytical skills as well as 1.5 million managers and analysts with the know-how to use the analysis of big data to make effective decisions\" [2]. In everyday life, people deal with large amounts of data regularly: online search engines provide access to millions of web sites almost instantly; consumer sites offer literally thousands of purchase options seamlessly; and social media sites let you create and benefit from extensive social networks. In bestselling books like Freakonomics, Super Crunchers and The Numerati, authors illuminate how more and more decisions in health care, politics, education, and other sectors utilize big data and data analysis [3]. The texts highlight the growing need for specialists and every-day citizens to be able to understand and interpret data. Whether it is a table of nutritional information, a graph of stock prices, or a chart comparing health care plans, the skills of understanding and interpreting data are necessary to navigate successfully through daily life. This talk starts with a review of visual analytics projects that aim to increase our understanding of how people learn, increase the efficacy of learning environments, or support decision making in education [4]. The second part of the talk provides a theoretical framework for the design of effective data analysis workflows and insightful visualizations. It also introduces plug-and-play macroscope tools [5], see also http:\/\/cishell.org, that were designed for different research communities and are used by more than 120,000 users from 40+ countries to design and benefit from visualizations of complex data. The talk concludes with a discussion of challenges that arise when visual analytics tools are introduced to classrooms and informal science education.","additional_locations":{"location":["http:\/\/portal.acm.org\/citation.cfm?id=2330604","http:\/\/dx.doi.org\/10.1145\/2330601.2330604","http:\/\/www.citeulike.org\/user\/anonyuser9b\/article\/11534127","http:\/\/www.citeulike.org\/user\/anonyuser9b\/article\/11534127","http:\/\/pubget.com\/search?q=doi:10.1145%2F2330601.2330604","http:\/\/www.ncbi.nlm.nih.gov\/pubmed?term=10.1145%2F2330601.2330604[aid]&cmd=DetailsSearch"]},"authors":{"author":[{"mm_name":"authors","location":"http:\/\/www.citeulike.org\/user\/anonyuser9b\/author\/B%c3%b6rner:K","name":"Katy Bￃﾶrner"}]},"source":{"mm_name":"source","title":"In Proceedings of the 2nd International Conference on Learning Analytics and Knowledge (2012), pp. 2-3, doi:10.1145\/2330601.2330604ￂﾠ Key: citeulike:11534127"},"keywords":{"document":[{"mm_name":"keywords","location":"http:\/\/www.citeulike.org\/user\/anonyuser9b\/tag\/no-tag","title":"no-tag"}]},"citeulike_user":{},"scholarly_article":{"mm_name":"source_article","location":"http:\/\/dx.doi.org\/10.1145\/2330601.2330604","title":"Visual analytics in support of education"}}}