{"ieee_xplore_article":{"location":"http:\/\/ieeexplore.ieee.org\/xpl\/articleDetails.jsp?arnumber=4522561","doi":"http:\/\/dx.doi.org\/10.1109\/TPAMI.2008.121","title":"VisualRank: Applying PageRank to Large-Scale Image Search","abstract":"Because of the relative ease in understanding and processing text, commercial image-search systems often rely on techniques that are largely indistinguishable from text search. Recently, academic studies have demonstrated the effectiveness of employing image-based features to provide either alternative or additional signals to use in this process. However, it remains uncertain whether such techniques will generalize to a large number of popular Web queries and whether the potential improvement to search quality warrants the additional computational cost. In this work, we cast the image-ranking problem into the task of identifying \"authority\" nodes on an inferred visual similarity graph and propose VisualRank to analyze the visual link structures among images. The images found to be \"authorities\" are chosen as those that answer the image-queries well. To understand the performance of such an approach in a real system, we conducted a series of large-scale experiments based on the task of retrieving images for 2,000 of the most popular products queries. Our experimental results show significant improvement, in terms of user satisfaction and relevancy, in comparison to the most recent Google image search results. Maintaining modest computational cost is vital to ensuring that this procedure can be used in practice; we describe the techniques required to make this system practical for large-scale deployment in commercial search engines.","additional_locations":{"location":["http:\/\/dx.doi.org\/10.1109\/TPAMI.2008.121"]},"rich_media":{"mm_name":"rich_media","location":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?tp=&arnumber=4522561","title":"PDF full text"},"articles_by_authors":{"ieee_xplore_search":[{"mm_name":"articles_by_authors","location":"http:\/\/ieeexplore.ieee.org\/search\/searchresult.jsp?searchWithin=p_Authors%3A.QT.Yushi+Jing.QT.","title":"Yushi Jing"},{"mm_name":"articles_by_authors","location":"http:\/\/ieeexplore.ieee.org\/search\/searchresult.jsp?searchWithin=p_Authors%3A.QT.Baluja%2C+S..QT.","title":"Baluja, S."}]},"references_page":{"mm_name":"references_page","location":"http:\/\/ieeexplore.ieee.org\/xpl\/references.jsp?arnumber=4522561","ieee_xplore_id":"4522561","title":"VisualRank: Applying PageRank to Large-Scale Image Search"},"citations_page":{"mm_name":"citations_page","location":"http:\/\/ieeexplore.ieee.org\/xpl\/citations.jsp?arnumber=4522561","ieee_xplore_id":"4522561","title":"VisualRank: Applying PageRank to Large-Scale Image Search"}}}